app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Safari"], ["name", "Firefox"], ["created_at", "2022-04-18 17:23:14.345128"], ["updated_at", "2022-04-18 17:23:14.345128"]]
---
  def create
    @article = Article.new(check_params)
    if @article.save