app/controllers/comments_controller.rb

  def destroy
    @article = Article.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]